app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_id", 2], ["created_at", "2022-06-26 11:26:08.637942"], ["updated_at", "2022-06-26 11:26:08.637942"]]
---
  def follow(user)
    relationships.create(followed_id: user.id)